Revit 2026 API

# StructuralAssetWoodGrade Property

---

The grade of wood used in a wood-based asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string WoodGrade { get; set; }
```
```vb
Public Property WoodGrade As String
	Get
	Set
```
```cpp
public:
property String^ WoodGrade {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member WoodGrade : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InapplicableDataException | When setting this property: the material type must be wood to set this property. |

Applies to wood-based structural assets.

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace